{
    "jei_desc.chocolate.placeholder": "This is a placeholder text. If you've found it, that means I've messed up really bad...",
    "jei_desc.chocolate.stage_one": "§4[Stage One]§r\nThis is a Stage One item! It can be used after unlocking 3 of the Eyes.",
    "jei_desc.chocolate.stage_two": "§4[Stage Two]§r\nThis is a Stage Two item! It can be used after unlocking 6 of the Eyes.",
    "jei_desc.chocolate.stage_three": "§4[Stage Three]§r\nThis is a Stage Three item! It can be used after unlocking 9 of the Eyes.",
    "jei_desc.chocolate.stage_four": "§4[Stage Four]§r\nThis is a Stage Four item! It can be used after unlocking 12 of the Eyes.",
    "jei_desc.chocolate.stage_five": "§4[Stage Five]§r\nThis is a Stage Five item! It can be used after unlocking 16 of the Eyes.",
    "jei_desc.chocolate.chemical_x": "This item can be obtained by brewing a Thick Potion with a Hulk Hammer, a Creeper Shard, a Mutant Skeleton Skull, or an Endersoul Hand. Splash it on a Zombie, Creeper, Skeleton, or Enderman and watch it mutate!",
    "jei_desc.chocolate.burning_ashes": "This item is dropped by the Ignited Revenants found in the Burning Arena, and can be used on an Altar of Fire to summon Ignis.",
    "jei_desc.chocolate.abyssal_sacrifice": "This item can be used on an Altar of Abyss to summon the Leviathan.",
    "jei_desc.chocolate.astral_dust_1": "This item can be brewed with any vanilla Tier 2 Potion (a potion with extended duration or amplified effect) to create an Ultimate Potion with both amplified effects AND an extended duration.",
    "jei_desc.chocolate.astral_dust_2": "Potions that cannot be amplified will have their durations doubled, and potions that cannot be extended will be amplified by an additional level.",
    "jei_desc.chocolate.mending": "Mending is now craftable, but can no longer be traded from Villagers.",
    "jei_desc.chocolate.infusion_table_1": "The Infusion Table can take enchantments from items and transfer them to books. The item is destroyed in the process, so don't use anything you're too attached to!",
    "jei_desc.chocolate.infusion_table_2": "Enchantment transferral is done with the following steps:\n1. Place a book on the table. \n2. Place an enchanted item on the table. \n3. Use a Flint and Steel on the table. \n4. Punch the table once the particles subside.",
    "jei_desc.chocolate.backpack_encumbering": "If you're carrying more than one backpack, a Slowness effect will be applied.",
    "jei_desc.chocolate.artifact_repair": "Artifacts can be repaired in an Anvil using Dubious Dust, which can be crafted from other Artifacts at any durability.",
    "jei_desc.chocolate.ignis_summon": "Place Burning Ashes on the Altar of Fire to summon Ignis.",
    "jei_desc.chocolate.leviathan_summon": "Place an Abyssal Sacrifice on the Altar of Abyss to summon the Leviathan.",
    "jei_desc.chocolate.crab_meat_blessing": "Place Amethyst Crab Meat on the Altar of Amethyst to bless it.",
    "jei_desc.chocolate.prismarine_to_elder": "When placed out of water, Prismarine Coral dries out and turns into Elder Prismarine Coral.",
    "jei_desc.chocolate.mech_eye": "When thrown, the Eye of Mech leads towards the nearest Ancient Factory, where the Harbinger awaits activation...",
    "jei_desc.chocolate.flame_eye": "When thrown, the Eye of Flame leads towards the nearest Burning Arena, where Ignis awaits its next challenger...",
    "jei_desc.chocolate.void_eye": "When thrown, the Eye of Void leads towards the nearest Ruined Citadel, where the Ender Guardian stands vigilant...",
    "jei_desc.chocolate.monstrous_eye": "When thrown, the Eye of Monstrous leads towards the nearest Soul Blacksmith, where the Nether Monstrosity lies dormant...",
    "jei_desc.chocolate.abyss_eye": "When thrown, the Eye of Abyss leads towards the nearest Sunken City, where the Leviathan lurks beneath the depths...",
  
      "jei_desc.chocolate.coal_ore": "Most common at y=96",
      "jei_desc.chocolate.iron_ore": "Most common at y= 16",
      "jei_desc.chocolate.copper_ore": "Most common at y=48",
      "jei_desc.chocolate.gold_ore": "Most common at y=-16, or mesas",
      "jei_desc.chocolate.emerald_ore": "Most common at y=256, only in mountains",
      "jei_desc.chocolate.lapis_ore": "Most common at y=0",
      "jei_desc.chocolate.redstone_ore": "Most common at y=-59",
      "jei_desc.chocolate.diamond_ore": "Most common at y=-59",
      "jei_desc.chocolate.nether_quartz_ore": "Everywhere in the nether with netherrack.",
      "jei_desc.chocolate.nether_gold_ore": "Everywhere in the nether with netherrack.",
      "jei_desc.chocolate.ancient_debris": "Most common at y=15,not exposed",
      
      "jei_desc.chocolate.zinc_ore": "Y=-63 - 70. Most common at y=-59",
      "jei_desc.chocolate.epicsamurai_ore": "Y=-64 - 30. Most common at y=-20",
  
  
  
      "jei_desc.chocolate.sponge": "Found in ocean monuments.",
      "jei_desc.chocolate.bookshelves": "Fifteen bookshelves placed one block spaced around an enchanting table gives max enchanting power.",
      "jei_desc.chocolate.candles": "Enchanting candle influencing: Different coloured candles can influence the likelihood of an enchantment being rolled.",
      "jei_desc.chocolate.white_candle": "White: Unbreaking",
      "jei_desc.chocolate.orange_candle": "Orange: Fire Protection, Torrent, Lavawaxed, Frost Aspect",
      "jei_desc.chocolate.magenta_candle": "Magenta: Knockback, Punch, Bolok's Furry, Sharpshooter, Backstabbing, Straddle Jump",
      "jei_desc.chocolate.light_blue_candle": "Light Blue: Feather Falling",
      "jei_desc.chocolate.yellow_candle": "Yellow: Looting, Fortune, Luck of the Sea",
      "jei_desc.chocolate.lime_candle": "Lime: Blast Protection",
      "jei_desc.chocolate.pink_candle": "Pink: Silk Touch, Channeling",
      "jei_desc.chocolate.gray_candle": "Gray: Bane of Arthropods",
      "jei_desc.chocolate.light_gray_candle": "Light Gray: Protection, Serpent Charmer",
      "jei_desc.chocolate.cyan_candle": "Cyan: Respiration, Loyalty, Infinity, Ceaseless, Returning Board",
      "jei_desc.chocolate.purple_candle": "Purple: Sweeping Edge, Multishot",
      "jei_desc.chocolate.blue_candle": "Blue: Efficiency, Sharpness, Lure, Power, Impaling, Quick Charge",
      "jei_desc.chocolate.brown_candle": "Brown: Aqua Affinity, Depth Strider, Riptide",
      "jei_desc.chocolate.green_candle": "Green: Thorns, Piercing",
      "jei_desc.chocolate.red_candle": "Red: Fire Aspect, Flame",
      "jei_desc.chocolate.black_candle": "Black: Smite, Projectile Protection",
  
  
      
      "jei_desc.chocolate.everbright_portal": "The entrance to the Everbright dimension. The portal is made of Turquoise Stone Bricks, and can be lit with a Zeal Lighter. It seems the Everbright is constantly day, but it's somehow always brittle and cold. The world is home to lots of large thick-coated fauna. Plenty of snow, and spirit-like enemies can be found here. During the snow, more enemies like to show their faces, as they much prefer the colder weather.",
      "jei_desc.chocolate.brewberry_bush": "A foliage found in the Everbright. When grown, it produces Brewberries. After further investigation, the type of Brewberry that the bush wields can be influenced based on the block you grow it on, however it doesn't seem to guarantee that you get said berry. Cherry Grass causes the bush to be able to produce Pink Brewberries, which grant you a small amount of regeneration. Growing it on Mycelium seems to allow it to grow Black Brewberries, which cure poisonous status effects. I was also able to find that growing the bushes on fertile soil, such as Farmland or Podzol, allowed the bush to produce an extra berry or so.",
      "jei_desc.chocolate.snowcap_mushroom": "With this world being much colder, sources of heat are harder to come across. However, thanks to some of my experimentation, I was able to find that some plants can be used as fuel. The most notable being the Snowcap Mushroom. It absorbs heat, making the nearby surroundings chilled to the touch. It can occasionally reach such a cold temperature that lava hardens on the spot. And as it turns out, this heat can be released in a furnace to produce a similar flame to that of coal.",
      "jei_desc.chocolate.snowcap_pinhead": "A small variation of the Snowcap Mushroom. It can be compressed into giant mushroom blocks, which, just as the Snowcap Mushroom is, can be used as quite the fuel source.",
      "jei_desc.chocolate.snowcap_oven": "With this creation, I was able to harness the Snowcap Mushroom's heating and cooling power. By sapping the heat out of warm objects, it can cook whatever you put inside, occasionally leaving the frozen byproduct of the fuel behind. It even allows for things such as water to be used as a fuel source, albeit not a very good one.",
      "jei_desc.chocolate.brumble": "One of the few ocean vegetations that can be found in the Everbright. Its faded red color contrasts very well with the rest of the ocean, it's very interesting to see such a color mixed amongst the blues and purples of the Everbright. I'm sure this could be smelted to create beautiful building materials.",
      "jei_desc.chocolate.taratite": "A smooth, almost minty blue-green colored stone. If polished, I'm sure this will make for a great building material.",
      "jei_desc.chocolate.rimestone": "A rough icey stone. If polished, I'm sure this will make for a great building material.",
      "jei_desc.chocolate.ventium": "A red metal, it can be found in most of the non-mountainous biomes in the Everbright. It seems to mostly take on the role of an iron equivalent in this world. Ventium can be used to create things like buckets, shears, and the Tool Box.",
      "jei_desc.chocolate.falsite": "This magical metal can be found inside the non-mountainous biomes of the Everbright. It has mysterious properties that allow for strengthening the durability of almost any tool from both the Everbright and Everdawn using a Tool Box.",
      "jei_desc.chocolate.pearl": "Obtained from the mouth of a Seclam. This shiny pearl seems to have some sort of mysterious property. Most enemies seem to not like me holding it. I might be able to combine it with Falsite to create something greater.",
      "jei_desc.chocolate.warding_pearl": "By combining a Seclam's pearl and a Soul Fragment with Falsite to create this, I'm able to prevent hostile mobs from appearing within a large radius. This is very helpful in this world, since light sources like Moonstone don't prevent mobs from appearing like they do in the Overworld.",
      "jei_desc.chocolate.soul_fragment": "A fragment of an evil soul. With all the ghostly enemies in the Everbright, these are quite a common item. One of the ways I'm able to harness its power is when crafting it with a pearl and some Falsite to create a Warding Pearl. Given how early I've found this in my journey, there are likely more uses I have yet to find as well.",
      "jei_desc.chocolate.azulfo_horn": "The horn of the mighty Azulfo. As most bones can be, I'm able to create Bone Meal from these. This allows for me to farm significantly faster.",
      "jei_desc.chocolate.summoning_table": "After visiting the Blinding Dungeon, I managed to get my hands on a Summoning Table. Since I was lucky enough to obtain this, I can use it to change the mode of my newfound Summoning Tome. It has the option of either shooting a Fluctuant Sphere, or summoning an Artificial Golem to fight alongside me. I will likely write more in depth about the tome in a separate entry.",
      "jei_desc.chocolate.soulbound_spear": "When I visited the Everbright's Blinding Dungeon, I found myself a Soulbound Spear. This spear seemed to function like a normal spear, however it always would come back to me after throwing it. This might come in handy when dealing with most of the enemies in this world.",
      "jei_desc.chocolate.summoning_tome": "Amongst the other useful tools I was able to get for myself at the Everbright's Blinding Dungeon, I was able to get the uncommon Summoning Tome. This allows me to cast some of the Summoner's spells. When I obtained the tome, right away it had the ability to conjure a Fluctuant Sphere. Using it I'm able to hit multiple enemies at once with a single projectile, as it damages anything within a radius of it. However, once I used the tome at the Summoning Table, I was surprised to see it had yet another ability! It granted me the ability to summon an Artificial Golem to fight alongside myself. The Golem seemed to be temporary though, only lasting me about a minute, so I'd better use it wisely!",
      "jei_desc.chocolate.nature_dungeon": "I managed to stumble upon a giant green pyramid structure in the Snow Covered Pines. After entering, I was greeted by many of its inhabitants. They seemed to be golems constructed entirely of the structure's stone, held together with Starlit Vines. As I was nearing the top of the dungeon, I started to realize that the build quality had been getting better the whole time! The bottom floors seemed to be very aged, and weathered away, while the upper floors were in almost pristine condition. Each floor seems to have a dungeon key in it, I'll assume that just like the Blinding Dungeon, there is a Keystone at the end of the tunnels to use. However, due to some rumors I've heard, I likely won't be going to see it for myself. I've decided to call this giant structure the §oNature §oDungeon§r.",
      "jei_desc.chocolate.crushing_hammer": "It seems like this hammer came directly from the Starlit Crusher itself! This mighty hammer has the power to slam the ground, just as the Starlit Crusher is rumored to do. It hurts everything around me when I use it, causing each enemy to fly into the air! This thing also packs quite a punch, doing lots of melee damage, it seems to be very heavy though.",
      "jei_desc.chocolate.everdawn_portal": "The entry to the Everdawn Dimension, created with Lunar Stone Bricks and lit with a Zeal Lighter. This world is always hot and humid, but the time is always at sunrise. Insects thrive here, especially during the rain when more of them leave their homes. The insects have grown to scary sizes, some being about half my size! The rain seems less heavy here, usually only a slight drizzle. The fauna here seem to be mostly reptilian, with few exceptions.",
      "jei_desc.chocolate.baneful_mushroom": "When exploring the Shaded Woodlands, I had to step with caution. Across this area, I found a seemingly harmless purple mushroom. However, after closer inspection, it has poisonous properties. The Baneful Mushroom reacts to contact by spraying anything on top of it with toxic spores as a defense mechanism. I should be sure to avoid this mushroom at all costs.",
      "jei_desc.chocolate.crystal_flower": "This flower is an interesting one. It's somehow a mix of crystal, and foliage. Upon closer inspection, if fertilized with something like bone meal, it is able to grow into a fully-fledged tree!",
      "jei_desc.chocolate.spider_webbing": "An interesting type of web, it has the ability to attach to corners, unlike normal webs. It seems to only be able to connect to either itself, or other walls.",
      "jei_desc.chocolate.crescent_fruit": "Thanks to the warm climate, the Everdawn is capable of nurturing some rather tropical food sources, the primary ones being Crescent Fruits. I've found that this fruit will grow on the bottom of almost any Crescent Fruit leaf and can be harvested seemingly indefinitely so long as the leaves are in bloom.",
      "jei_desc.chocolate.sunstone_crystal": "These crystals are hot to the touch, sporting a glowing orange color. They can be used as fuel at any furnace, as well as a way to charge the Horizonite Forge. These can be found deep in the Sunset Maple Forest, and the Searing Grasslands.",
      "jei_desc.chocolate.horizonite_forge": "I've done it! I have harnessed the power of Horizonite! With this, I'm able to smelt things without any fuel. This does come at the cost of re-charge time. It can be charged instantly using anything composed of Horizonite. I can also use Sunstone as another means of charging it quicker. The Forge will only recharge if there is nothing cooking inside of it. Having multiple of these would likely be very beneficial.",
      "jei_desc.chocolate.cinderstone": "This magma-like stone could definitely be used as quite the building material. I'm sure it can be polished into something nice as well.",
      "jei_desc.chocolate.umber": "A smooth brown stone. This could probably be polished into an even smoother building material.",
      "jei_desc.chocolate.crystallized_tree": "This tree has incredibly strange properties. It can't be made into sticks, and it doesn't burn. The wood seems to be entirely made from crystal, it's even transparent. With their properties, I'm sure the logs could be made into walls. That would make for a great fence replacement. Since the tree isn't exactly pure foliage, it doesn't have any saplings. I discovered that Crystal Flowers, if fertilized using bone meal, can be grown into one of these trees if planted on their native sand.",
      "jei_desc.chocolate.horizonite": "Found in the Crystal Dunes, this metal is extremely hot, I can't believe it doesn't just melt! I'm not sure how it stores so much heat. I discovered that any tools created from it are able to smelt ores right from the stone! I was also able to create a furnace from this material, which I've decided to call the Horizonite Forge.",
      "jei_desc.chocolate.moonstone_shield": "This shield is quite a bit more durable than a normal wooden shield, it also sports a transparent look like Vitrous Moonstone does, allowing you to see things through it.",
      "jei_desc.chocolate.fox_pelt": "Obtained from Cosmic Foxes, this can be used to create Camel Saddles, and the Bag of Spoils.",
      "jei_desc.chocolate.spike_shield": "After my visit to the Everdawn's Blinding Dungeon, I was able to obtain a Spike Shield for myself. This shield is quite a bit more durable than both the wooden shield, and the Moonstone shield. This shield seems to have some extra melee damage, so it can double as a weaker weapon.",
      "jei_desc.chocolate.alchemy_table": "During my visit to the Everdawn's Blinding Dungeon, I was lucky enough to get my hands on the Alchemist's Alchemy Table. These are quite uncommon nowadays, so I'm glad I was able to get one. Using this, I can change most raw Everdawn materials to Everbright ones, and vise-versa. I could see this being especially helpful when building. If I wanted to, I could change Lunar Stone into Turquoise Stone if I had an abundance of it. It seems I can also combine stone with my Arc, allowing me to get dungeon stone. I'm sure this will work with the other arcs, I just don't have them…",
      "jei_desc.chocolate.alchemy_scroll": "Following my exploration of the Everdawn's Blinding Dungeon, against all odds I obtained an Alchemy Scroll, the dungeon's most rare treasure. Using this I can mimic the Alchemist's Decaying Spike spells. It conjures Decaying Spikes in a line above me wherever I point it. I can also use the second variation of the attack by crouching, which creates the spikes facing upward all around me, knocking close foes away.",
      "jei_desc.chocolate.poison_dungeon": "During my exploration of the Sunset Maple Forest, I was able to locate a strange looking tree. It was covered in webs, and to my surprise, inside of it was a giant spider nest! This place is home to many Venom Spiders. I was also surprised to see that the Overworld's Cave Spider made its way into this nest. Each floor has a dungeon key in it, I'll assume that just like the Blinding Dungeon, there is a Keystone at the end of the tunnels to use. I can hear what sounds like loud hissing through the halls of this place, I can't imagine what's at the end... I think I'll call this place the §oPoison Dungeon§r.",
      "jei_desc.chocolate.venom_sac": "Following my trip through the Poison Dungeon, I managed to obtain a Venom Sac. With this, I can fire spurts of venom, just as the Arachnarch is rumored to do. The damage the projectile inflicts is minor, but it also infects the victim with a deadly venom.",
      "jei_desc.chocolate.different_sword": "A very interesting sword, meant for quick combat. This weapon seems to have been designed with the intent of slaying the target as quickly as possible. If I were to wait too long after hitting the target, they would heal off more damage than I dealt. Knowing this, it's likely a good idea to avoid using it on bulkier targets.",
      "jei_desc.chocolate.blinding_dungeon": "In my travels, I was able to find a giant tower structure. I decided to dub it the §oBlinding §oDungeon§r. It seems this dungeon has 2 variations, one in the Everbright, and one in the Everdawn. Both are home to Illagers. The Everbright has the Summoner, and the Everdawn has the Alchemist. The two can be visited by bringing 4 Blinding Dungeon keys to the Keystone at the top floor of their respective dungeons. I myself don't plan on picking too much of a fight with either of them.",
      "jei_desc.chocolate.moonstone": "Found underground in both worlds, it seems to purely be a source of light. It functions underwater, and can be made into larger blocks that also emit light. It also has a crystal variation found in some of the caves in these worlds. I don't believe it does anything special like the Sunstone crystal does, but it does look rather pretty.",
      "jei_desc.chocolate.pyrope": "This gemstone can be found anywhere underground in either world. It seems tools created from such a material are very light, so I can use them very fast. These tools don't seem to be very durable though, so I'd better use them with caution. Due to this material's softness, it can't harvest the best materials for gear from these worlds, such as Diopside and Charoite.",
      "jei_desc.chocolate.aquite": "This aqua blue mineral seems to be similar to the Overworld's iron when it comes to tools and armor. After some experimentation, it does seem very enchantable on top of that.",
      "jei_desc.chocolate.diopside": "This spiky, almost crystalline shaped gemstone has a lime green color to it. I found it very deep underground in both worlds. The armor and tools created from this material are §overly§r durable and strong. The tools are very heavy, and inflict extreme damage to anything I hit. Something to note though, due to their heaviness, these are much harder to swing than most tools. I'll have to be careful when dealing with fast targets. This set of gear competes with Charoite. The weapons being slower, but more durable and hard hitting alternatives, while the armor deals with heavier blows better than Charoite. Tools made from this material can harvest everything I have discovered in these worlds so far.",
      "jei_desc.chocolate.charoite": "A more neutral set of armor and tools, being similar to the Overworld's diamond in most regards. This set of gear competes with Diopside. The tools being faster but weaker alternatives, while the armor handles lighter blows better than Diopside.Tools made from this material can harvest everything I have discovered in these worlds so far.",
      "jei_desc.chocolate.star_emitter": "Usually accompanied by a villager working as a Stargazer. This interesting device can put the Astrolabe to use. Using an Astrolabe on the object will allow the user to teleport back to its position. I will write a more detailed description of the Astrolabe in its own entry.",
      "jei_desc.chocolate.trough": " A simple wooden trough. If baby animals are near this, they have a chance to eat from it. When an animal does eat from the block, it will allow it to grow up faster. It can be filled with most animal breeding items, like carrots, potatoes, scalefruit, and pine fruit. If a villager decides to work here, they will be a Wrangler.",
      "jei_desc.chocolate.tool_box": "This very useful workbench can be used to enhance and upgrade tools. This seems to be Falsite's primary use, it can increase durability when put along almost any tool from these worlds. Yet another discovery, any stick from these worlds can be swapped in onto any tool. It seems almost all the sticks have different uses, I'll have to see which ones work well on each tool set.",
      "jei_desc.chocolate.bag_of_spoils": "A small bag that can carry almost anything, and can hold a maximum of 5 different items inside of it. I figured out I could pick-pocket any villager by crouching and using it on them while they weren't looking. Whenever they saw me do it, as expected they would be quite unhappy about it, even the Iron Golem of the village attacked me. The only individual I was not able to pick-pocket was the Nightwatcher, who gave me the bag in the first place. Suffice to say, I won't be visiting THAT village again...",
      "jei_desc.chocolate.food_prep_table": "A table made for preparing meals. It can accept a maximum of 5 ingredients, with 3 being the minimum needed to create a proper dish. By using lots of unique ingredients, I'm able to make better meals than usual. The more hearty the ingredients, the more servings the meal will have. Knowing this, using meat seems to be the most beneficial toward making my food last longer.\n\nBy incorporating flowers as a sort of seasoning, it seems possible to draw out their latent potion effects. I've heard of people in the Overworld doing this to make stews, though I'm certain my methods are superior.\n\nFor a longer lasting or more potent effect, Potions may also be used like a sauce. Though it seems I can only use one without causing instability...\n\nThrough experimentation, I discovered that using a Brewberry can enhance the flavor of all effects, extending their duration. It's possible to make a dish based purely on effect-granting ingredients. Doing this won't make the dish very filling, but it could be exactly what I need in some situations. Though I wouldn't complain if I could find a flower that enhances the heartyness of my food.",
      "jei_desc.chocolate.astrolabe": "I was able to find this useful item by trading with one of the village's local Stargazers. By combining this item with a Star Emitter, I can teleport a moderate distance across the world to return to it. This isn't something I can use constantly however, as the Astrolabe's power will have to recharge for a time relative to the distance I teleported from.",
      "jei_desc.chocolate.spears": "Incredibly useful tools designed to hurt targets from afar. These function as a mix of the Overworld's trident and bow, being cheap to make, and usable underwater. I found spears may be enchanted with things such as loyalty, and piercing.",
      "jei_desc.chocolate.stick_variations": "Today I've made an incredible discovery. I found that the wood variations of these worlds have different properties, sometimes due to their age, or their tree's living conditions. These properties transfer over to the sticks created from the wood, meaning I can change the properties of whatever tool I make!\n\nStarting off with the most basic variations, being Bluebright and Lunar. These are the most similar to the Overworld's typical stick type. Tools sport their normal properties, with average weight, and strength. If I want something reliable, I know I can count on these sticks.\n\nNow into the more interesting ones, Frostbright, and Maple. These wood variations are incredibly dense and heavy. Tools with sticks made from either of these wood variations will be much more durable, at the cost of making them harder to swing at targets. Knowing this, both of these sticks are better to put on tools, rather than weapons. This also affects spears, making them harder to throw, but they are more durable.\n\nLastly, there is Starlit, and Dusk. These wood variations seem to be the oldest of the worlds. They're very light, and fragile. I can't imagine tools built using these would last for very long… I did find that making weapons was well worth my time, as it makes them much easier to swing, and in the case of spears, much easier to throw.\n\nThere is actually one more stick type, the most rare of them, Cherry. This elusive wood variation is almost entirely a direct upgrade to the previously mentioned Frostbright and Maple. Its added strength doesn't add any more weight than those others do, but it is ever so slightly more durable.",
      "jei_desc.chocolate.arcs": "In the folklore of the people who inhabit these worlds, there is mention of legendary artifacts known as Arcs. These artifacts are rumored to only be held by the protectors of each dungeon structure in these worlds. Each Arc is said to grant special powers to the one who bears it.",
      "jei_desc.chocolate.enchanting": "Just like in the other worlds, enchanting is possible from within the Everbright and Everdawn. To do it within these worlds alone, you would need to collect Charoite, which serves the same purpose as the Diamond, Obsidian from the Everdawn, and Falsite from the Everbright.\n\nI found Falsite has similar properties to Lapis Lazuli when used in the Enchantment Table as a catalyst, however a full ingot is too much for this process. By turning the ingot into nuggets, I can use it just like I would with Lapis.",
      "jei_desc.chocolate.azulfo": "The largest of the Everbright's fauna. I found plenty of these along my journey. They can be found in large herds, and generally follow the herd leader. Hunting them can be quite hard, as unlike the Overworld's animals, these won't go down without a fight. In fact, the whole herd will get riled up when you do this. I found that spears tend to be the most useful tool you can use to hunt them safely.",
      "jei_desc.chocolate.stardust_ram": "The Everbright's most common fauna. These wooly creatures are very similar to the Overworld's sheep. They can be sheared using shears, and hunted for mutton. These creatures can be bred using the world's local pine fruit crop.",
      "jei_desc.chocolate.reindeer": "The reindeer is one of the most useful animals I found in the Everbright. They can be tamed using pine fruit, and equipped with a saddle. They can be ridden at a moderately fast speed, and can jump around 2 blocks high. I was only able to find these critters in open snowy areas, such as the Brightlands and Snow Covered Pines. Reindeer may also be hunted for venison, however with their more picky living climates, I generally avoid doing so.",
      "jei_desc.chocolate.snow_owl": "These beautiful sounding creatures can only be found in the Frostbitten Forest. They generally live atop the trees of the biome. They can be heard from large distances, which adds to the mysterious feeling of the Frostbitten Forest.",
      "jei_desc.chocolate.grittle_flatfish": "Being one of the most unique fish creatures in the oceans, the Grittle Flatfish is very skittish. It tends to be scared very easily, attacking whoever might come near, and making a run for it shortly after. It doesn't hurt very much, but I can't help but feel bad for the little thing whenever I do manage to scare one. These fish are quite the delicacy, and tend to fill me up more than any other fish.",
      "jei_desc.chocolate.armored_frost_spirit": "The Frost Spirit is one of the most common enemies I found on my journey. These creatures aren't quite what they seem, they might look aggressive and angry, but underneath that ice is a small spirit that couldn't hurt a fly. Once freed, it will try to escape, likely dodging most strikes you'll make towards it. Once slain you might be able to get yourself a soul fragment or two. I found that using any pickaxe does more damage to its icey body, usually slaying it quicker than my weaker swords.",
      "jei_desc.chocolate.crynocerous": "I didn't see this one too often, the Crynocerous seems to be a much larger, more powerful version of the Armored Frost Spirit, sharing much of the same qualities. It has more range, and strength than the Armored Frost Spirit does. I was only able to find this beast inside snowy climates, like the Brightlands. Just as the frost spirit does, it takes more damage when hit with a pickaxe than hitting it with a sword.",
      "jei_desc.chocolate.polargeist": "On my journey I encountered a ghostly bear. This creature is surprisingly fast, being able to outrun me in most cases. It has ice hanging from its belly, and has fangs made of ice. When it attacks, it stands up on two legs, and slams down on its target. I found that it will not attack if you knock it back quickly enough, as it takes time for it to stand up.",
      "jei_desc.chocolate.whistleshell_crab": "This large crab creature is able to walk both on land and in water. It looks like its claw almost resembles a mouth with teeth. On land, it's very fast, and leaves almost no time to run away. Although they have lots of speed, they don't have much range, so it's easy to avoid attacks on land. In water it's quite a bit slower, but is able to dash through the water when grounded. The safest way to take it out in water is to stay high, since it can't swim.",
      "jei_desc.chocolate.shrumpty": "Oftentimes when I would explore the Slushlands, I would be startled by a Shrumpty. These sneaky fellows camouflage with the Snowcap Mushrooms, and strike when a predator is near. Their touch is very cold, causing their targets to freeze up and slow down. They even laugh creepily when they manage to land a hit, very strange…",
      "jei_desc.chocolate.diophyde_prowler": "Amongst the many enemies I've faced in the Everbright, there's not one similar to the Diophyde Prowler. This enemy circles its prey, pouncing in when the time is right. I found the easiest way to avoid their attacks is to strafe in the opposite way it's moving. It's so fast that there's no sense in outrunning it, it's more worthwhile just to fight it. I also found that using one of the Everdawn's shields can stop it in its tracks, leaving it vulnerable to attack.",
      "jei_desc.chocolate.seclam": "Occasionally, when I would traverse the deep oceans of the Everbright, I might encounter a Seclam. These calm creatures don't move at all, instead just showing off their beautiful pearl. Whenever a possible predator might approach it, the clam will close its mouth, preventing anything from stealing its shiny pearl. I found after hitting it a few times, it would open up, and I could safely take the pearl from its mouth. I had to be careful however, as if I was too slow it would close on me, which would likely hurt a ton.",
      "jei_desc.chocolate.stonelet": "During my visit to the Nature Dungeon, I encountered plenty of these strange looking enemies. These are the protectors of the dungeon, attacking anyone who dares to trespass in it. I figured out that similarly to the frost spirit, these creatures are hurt more by pickaxes than anything else. Knowing this, I was easily able to traverse the dungeon.",
      "jei_desc.chocolate.spewter": "During my exploration of the Nature Dungeon I had found these interesting plant creatures growing in the gardens of the top floor. They spit seed bombs at me whenever I would go near them, so I had to keep my distance.",
      "jei_desc.chocolate.summoner_pre": "At the top of the Everbright's Blinding Dungeon, I got into a fight with an individual wearing a collared purple coat. He had used his magic powers to summon golems composed of the dungeon's stone. I found that most times I approached this sorcerer, he would teleport himself to another section of the room. I did notice however, if he happened to be spellcasting, I could approach safely, possibly being able to land a blow. I was able to understand that if I kept the count of the golems lower than what he summoned, but higher than 1, he would begin conjuring more. I used this as my time to strike. Unfortunately, my visit to the dungeon was cut short by my power being outmatched by this individual, so I had to escape early.",
      "jei_desc.chocolate.summoner_post": "After combining my own first-hand knowledge with some of the tales from the locals, I can finally write a more detailed description on who the locals called, the Summoner. This sorcerer lives atop the Everbright's Blinding Dungeon. Unlike the Alchemist, the Summoner uses his summons to do the fighting for him. He can use magic to first summon ranged golems that fire projectiles at who dares enter the top floor. This is then followed by several more melee oriented golems also attacking the trespasser. These golems are known as Artificial Golems. The individual tends to favor keeping multiple Artificial Golems around. The Summoner also teleports to safety if approached while not casting a spell. Knowing these facts, by defeating some of the golems, the Summoner will leave himself open to attacks while summoning more. For a more general attack, the Summoner uses balls of magic known as Fluctuant Spheres to hit anything that might come near him. Something that must be known though, is that if approached too quickly while casting one of these spheres, the Summoner will instead create powerful strange lightning, bringing levitating blue fire into the mix. After learning and piecing together all of this information, I can't help but think I've met this individual before.",
      "jei_desc.chocolate.starlit_crusher_pre": "I've only heard rumors of the legendary Nature Dungeon guardian. They say it protects itself with giant wooden walls, and can summon other plant-like enemies to aid it in battle. I've heard that the only way people have found to leave it vulnerable is by throwing something with a sharp point at it, such as a spear, after chopping down one of its walls. If it were me, I would almost certainly want to also come equipped with an axe to chop it down.",
      "jei_desc.chocolate.starlit_crusher_post": "I've finally learned enough about the Starlit Crusher! I've learned that it uses 4 walls to protect itself in battle, shielding itself from any attacks. While the walls are up, the Crusher will grow things such as roots, Spewters, and Wooden Snow Owls to assist it in battle. Once it has sustained enough damage, said roots will grow bigger in size. Once one of the walls has been destroyed, it will begin smashing the ground in anger, leaving itself vulnerable to any projectiles, such as a spear. Once stunned, it can be attacked with any weapon, however an axe is said to be ideal to chop it down.",
      "jei_desc.chocolate.cosmic_fox": "One of the smallest animals I found in the Everdawn had to be the Cosmic Fox. I managed to find the little critter in more open areas, such as the Searing Grasslands and the Unorthodox Valley. I was able to tame the fella using Crescent Fruits, and it would follow me around wherever I went. It even listens to commands!",
      "jei_desc.chocolate.crystal_camel": "The beautiful Crystal Camel. Only located in sandy biomes, this incredible creature walks the desert, enjoying the heat of the area. I found that they enjoy eating Scalefruit, and I was able to tame one for myself. After creating myself a Camel Saddle, I was able to ride it. I learned that I can mount a chest on its back, allowing me to carry lots of items easily. One con to this however, is that camels aren't exactly the fastest animals, so I was only able to move at a slower pace.",
      "jei_desc.chocolate.shade_monitor": "Being the most common of the Everdawn's fauna, this animal looks to be the prime hunting choice of most in this world. They adapt to whatever area they might be in, having a different camouflaged look based on the biome. Beware if you try to hunt these animals however, as they won't back down without a fight! Their speed is unmatched by any of the other animals in the Everdawn. They aren't as powerful as the Everbright's Azulfo, but they still hurt quite a bit if unequipped.",
      "jei_desc.chocolate.crogre": "My personal favorite, the Crogre. A giant frog living almost exclusively in the Moonlit Reservoir. They jump very high, clearing around 4-5 blocks of height. The giant insects of the Everdawn seem to not like this fella very much, usually running away as soon as they manage to get close. I found they enjoy consuming bug guts, allowing me to tame one for myself. Afterwards, I was able to saddle one up and ride it! I found I could also ride it on water, allowing me to traverse the reservoir with ease over land and water!",
      "jei_desc.chocolate.nyctofly": "One of my biggest concerns while in the Everdawn was the Nyctofly. The air-born insect lives in heavily wooded areas, such as the Shaded Woodlands. It has quite the eyes on it, being able to see targets from incredible distances. Whenever I would hear its wings fluttering, I knew it was time to fight. A big thing I learned is that they can be much harder to fight in an open area, so I advise staying in a tight space.",
      "jei_desc.chocolate.venom_spider": "One of the more common enemies I would have to face in the Everdawn was the Venom Spider. They tend to be quite smart, switching their attack tactics based on where you are. If I chose to go straight in to attack it, then it would try to bite me directly with its venomous fangs. If I would decide to keep my distance, it would spit at me with poisonous spit. Using a shield helped me out in most scenarios when fighting these creatures.",
      "jei_desc.chocolate.emberback": "These giant beetle creatures can be a challenge to fight without being aware of their battle tactics. The Emberback can be found flying towards its targets. Once near, the insect will drop down, expelling flaming hot air from under its shell. These insects are very smart, and can detect whether you've consumed a fire resistance potion, and will instead try to bite you for lower damage output. An easy way to take care of these bugs is either by using a shield, or by luring them to a body of water.",
      "jei_desc.chocolate.infested_swarmer": "This elusive insect can only be found underground, or rarely aboveground in heavily crystallized areas, such as the Crystal Roughs. These giant ants don't have much for battle tactics, instead they mostly have speed and size. I almost feel bad for the poor thing with how strangely mutated it has become.",
      "jei_desc.chocolate.nested_spider": "At the end of my Poison Dungeon trek, I encountered what seemed to be spider nests. I would occasionally see a Nested Spider peek its head outside, so I'd assume that this is where the smaller spiders rest.",
      "jei_desc.chocolate.alchemist_pre": "Atop the Everdawn's Blinding Dungeon, I got into a battle with a person wearing a hooded red garment. He used magic to conjure bundles of arrows, and spiky rocks made of the world's native stone. It seemed the arrow bundles could easily be blocked by using a shield. This character was also able to drop potion clouds within the corners of the room, granting him a place to flee. A pattern I was able to notice is that every attack that I could not block, was able to be easily avoided. It seems the most powerful attack he has at his disposal is the spikes, as they can pierce through armor. Unfortunately this short match did not play out in my favor, so I had to escape before I could learn more. I'll have to speak with the locals to try to get more information.",
      "jei_desc.chocolate.alchemist_post": "After hearing tales from the locals, I was able to expand my knowledge on who they dubbed, the Alchemist. The sorcerer that hides out atop the Everdawn's Blinding Dungeon. In contrast to the Everbright's Summoner, the Alchemist does most of the fighting himself, throwing projectiles, and using attacks that cover a large area like potion clouds. Similarly to the Summoner, the Alchemist can escape anything that might approach him by teleporting away. He cannot teleport when spellcasting however, meaning every time he attacks he leaves himself open. \n\nStarting by mentioning the projectiles, in my own encounter, I found Decaying Spikes can pierce through armor, and hurt quite a bit. Unfortunately for the Alchemist, these are very easy to dodge. If you approach him too quickly however, they will appear from around his feet facing upward. For the other projectile, the Alchemist can use arrow bundles. These arrows do have quite the punch to them, and can send you flying across the room. From what the locals said, as the Alchemist gets weaker, there's a chance some may be set aflame. Thankfully there's water fountains in the room for most of the fight. This can change however as I've yet to mention another ability the Alchemist has, fluid conversion. The Alchemist is able to convert water to lava, and vise-versa. This can change the tide of the battle quickly if you manage to be burned by him. \n\nNow I'll get to the last things the Alchemist can do. He is able to temporarily blind everyone in his room, this is rumored to only last for a short time, so I wouldn't worry too much. The final thing he is able to do is heal himself when weak. Since he is left open for attacks the entire time, with proper weaponry and aggression, his healing can be out-damaged. After hearing all these rumors and putting this information together, I can't help but feel like I've met this person before.",
      "jei_desc.chocolate.arachnarch_pre": "With some of the tales I've heard about this giant arachnid, I would be terrified to face it myself. From what I understand, it is able to use its giant size to lunge at any of its targets when grounded. With what I've learned from most of the Everdawn's predators, a shield would likely do wonders against it. I've also heard that unlike most of the giant spiders in the world, this one is able to latch on to the ceiling to avoid most attacks.",
      "jei_desc.chocolate.arachnarch_post": "With some newfound information I've learned, I'm able to write a full entry on the Arachnarch. This creepy crawler is able to latch onto the ceiling, keeping herself away from most, if not all attacks. In this position, she seems to be more defensive, attacking it here isn't effective. If this is true, I would advise stalling her out until she is no longer able to keep herself on the ceiling. Then when grounded, I've also heard she can lunge herself towards targets using her massive amount of weight. As with most Everdawn enemies, I tend to use a shield against enemies like this. From what I understand, the collision against the shield causes the spider to become dizzy, leaving her vulnerable to attacks.",
  
  
  
  
  
  
  
      "jei_desc.chocolate.leptictidium": "These specialiazed little creatures hopped around on two legs, and were omnivorous, consuming a diet of insects, lizards, and mammals. They were best suited to the forest environments of the world 50 million years ago.",
      "jei_desc.chocolate.eolactoria": "This prehistoric cowfish had incredibly long horns. These fish can be caught in buckets of water for transportation.",
      "jei_desc.chocolate.doedicurus": "This massive armadillo-like creature weighed up to 3,000 pounds and grew to be 13 feet long! They feed primarily on sweet berries, and don't take kindly to those who provoke them. If you do decide to provoke one of these creatures, they will respond with a tail strike which may knock a few osteoderms off should they hit a shield. Crafting some osteoderms together produces a unique chestplate that seems to protect the wearer from damage while they are crouching. Of course, it cannot protect against all of damage...",
      "jei_desc.chocolate.dawn_horse": "One of the earliest in the horse lineage, this small equine has a diet of mostly leaves, and is preyed on by wolves.",
      "jei_desc.chocolate.apthoroblattina": "This immensely large paleozoic cockroach was nearly two feet long. Hatching an Apthoroblattina Ootheca will result in a nymph, which will take some time to mature into an adult.",
      "jei_desc.chocolate.ulugh": "A dubious theropod from the Late Cretaceous period, these medium-sized dinosaurs are rather tame as they seem to be more used to chasing beach dwellers rather than bigger game. However, one of their most unique traits is their crest colors. These crest colors determine what style of life these dinosaurs live. Blue crest-colored individuals are much faster, being more adapted to chasing down prey. White crest-colored individuals are more bulky, much more adapted to fending off predators or rivals. Orange crest-colored individuals have much more powerful bites, allowing them to crack bones for nutrients. Yellow crest-colored individuals have a special venom that disables joints, particularly in the arms, this will prevent the player from doing any actions with their hands besides mining and attacking Brown crest-colored individuals have are very durable, having thick scales that protect the animal. These creatures are also relatively easy to tame and ride, as their preferred foods are indicated by their crest colors. So far, I have found that the following foods can tame these crest colors. White: Raw Austroraptor Blue: Raw Scaumencia Yellow: Golden Scaumencia Orange: Raw Coty Brown: Raw Stethacanthus There is a high chance that more crest colors exist that I have yet to document and more foods I have yet to discover for taming.",
      "jei_desc.chocolate.trike": "Hailing from the Cretaceous, these large herbivores dominated their niche during their time. These large herbivores reined supreme as they could hold their own against most large predators, including the formidable Tyrannosaurus Rex. These dinosaurs are docile unless provoked. When aggressive they will steamroll any would be attackers. They can be fed Ginkgo fruits to tame them. When ridden these massive creatures are fairly fast, allowing them to hurt large saves of mobs with ease. Though when ridden they become rather focused on moving in one direction, making their use slightly limited. When these beasts grow up from childhood, they will shed their adolescent horns. These horns can be refitting into the power Trike Shield, one of the few shields strong enough to withstand a few attacks from a Tyrannosaurus Rex.",
      "jei_desc.chocolate.talpanas": "A very strange bird from the Holocene, these ducks lived in caves on islands living the troglodyte lifestyle, spending their lives in the dark. These ducks prefer the dark, panicking in areas that are too bright. If one is able to catch a duck, they can hold it on their heads. While the duck may panic, it will not flee as it is afraid of heights. Talpanas will also dig in rooted dirt in search of food, digging up bits of hanging roots to be used for decoration purposes.",
      "jei_desc.chocolate.stetha": "A small shark relative with a strange head piece. Like many smaller aquatic animals, they can be bucketed. These animals can be killed for their somewhat filling meat, though they are best used in small aquariums with good foliage.",
      "jei_desc.chocolate.smilodon": "Smilodon is a large cat hailing from the Early Pleistocene to Early Holocene, acting as one of the greatest foils to early humanity for quite some time. These large felines DNA can be obtained regularly through permafrost fossils, however sometimes larger glacial icebergs will have entirely frozen specimens inside them, bolstering a much higher chance of smilodon DNA. Smilodons when revived will hunt humanoid creatures quite voraciously, however they have a much softer side to them. When together they'll begin to groom each other, leaving behind bits of smilodon fur. For those brave enough to collect it, they'll discover that this is a vital key in the construction of birthing pods, which are vital to reviving ancient animals who don't have a living descendant today. Another key trait about smilodons is that they are one of the few creatures that actually have a modern relative alive today, the humble Ocelot. They are one of the few creatures that can actually birth a living smilodon successfully, albeit with a skin tone similar to that of their mother.",
      "jei_desc.chocolate.sludge": "Sludge are an amalgamation of tar and natural magic, forming entirely around tar pits. These creatures attack by slapping their targets with their wet tar hands. When killed, they drop some tar fossils which got stuck inside them.",
      "jei_desc.chocolate.scau": "A small lungfish from the Devonian period, these small fish don't offer much outside of meat and decoration. Like many smaller aquatic animals, they can be bucketed. While not very useful these fish are favored by Dunkleosteus, being able to be to pacify the monstrous beasts. One must use a golden Scaumenacia to pacify them.",
      "jei_desc.chocolate.sarracenia": "Sarracenia is a part of the group that makes up pitcher plants, with their earliest relatives dating back to the Early Cretaceous. These plants are a very common find from plant fossils and can be turned into a tall version via bone meal. They can also be crafted into red dye.",
      "jei_desc.chocolate.rex": "The most famous of the dinosaurs, these massive theropods hail from the cretaceous period. While neutral to people at first, if hit these creatures become quite ferocious in their rage. The Tyrannosaurus can dish out a variety of attacks from a weak stomp that causes a small cloud of weakness to a deadly tail whip that launches attackers back. Their most deadly attack however is their devastating bite attack. This attack can easily destroy weaker shields and can nearly instantly kill most prey. The best way to deal with this creature in its enraged state is to come prepared with potions, tough armor, and golden apples for resistance and regeneration. When the beast is almost near death it will fall into a weakened state. During this state it cannot attack or move. When an Adorned Staff is used on it in this state it will heal up and drop some rewards. These rewards consist of scales and teeth. Scales can be used to craft a fine trophy of the beast while the teeth can be used to craft a Veloci-shield. Another by product of the pacification is that they will become completely pacified, not attacking humans nor animals that hurt it. Scales can also be used for the creation of Rex Boomboxes, a block that creates a boom effect around it when activated by redstone.",
      "jei_desc.chocolate.raptor": "These iconic Cretaceous theropods are quite the clever fiends. These small animals are able to open up doors with ease and will even press amber buttons, as they seem to smell almost familiar to them. Sometimes while engaging in these activities they will shed a few feathers. These feathers are a vital part of crafting the Veloci-shield, a small shield that allows for a short burst of speed in a certain direction. However, it's small size prevents it from actually blocking attacks.",
      "jei_desc.chocolate.raiguenrayun": "Raiguenrayun is a tall species of dandelion that grew during the Eocene period. These plants are 2 blocks tall and can be crafted into yellow dye.",
      "jei_desc.chocolate.quereuxia": "Quereuxia is an aquatic plant that lived during the Upper Cretaceous. These plants have a unique growth cycle, growing up from the bottom of a water source into a cluster of small aquatic clovers. Their stems can be used as fuel, however they burn for an abysmal amount of time.",
      "jei_desc.chocolate.paraceratherium": "The largest land mammal to ever walk this planet, these creatures lived during the Oligocene. Due to not having any living descendants, these creatures must be revived via a birthing pod. Their size is also reflected in their behavior as for some unknown reason they seem to be extremely aggressive, stomping and slamming anything that comes near them despite their herbivorous status. While I am unsure why they are this hostile, the answer may lie within the black specks that seem to be writhing all over them, though I need to do more thorough inspection.",
      "jei_desc.chocolate.paleophis": "An absolutely massive relative to the soggy elephant trunk snakes, these large creatures prefer to be in rather large aquatic enclosures. These snakes also are entirely aquatic, as their muscles cannot hold themselves up outside of water. A rather unique phenomena among this species of snakes is that they give live birth, as such due to not having any living descendants, these creatures must be revived via a birthing pod. These animals are temperamental, preferring to be unbothered. Over time, these large snakes will begin to shed, leaving behind trace amounts of skin in the process. If one were to obtain this skin, even in its shed state it is durable enough to be fashioned into Shedscale Armor. When the full set is worn, the wearer becomes extremely fast in the water and gains greater dexterity with opal items.",
      "jei_desc.chocolate.pachy": "These small dinosaurs from the Cretaceous have quite the attitude despite their relatively small size. While they will tolerate nearby people, after some time they will begin to attack. They unleash a flurry of attacks ranging from headbutts, head slams, to even kicking. However, if you give a pachy some raw ginkgo seeds, they will become passive for much longer time along with granting you with Pachys Might. This effect increases attack knockback by a wide margin.",
      "jei_desc.chocolate.nelumbites": "Nelumbites is a exinct species of water plant that resembles a lilypad. These plants can be placed on the surface of water.",
      "jei_desc.chocolate.megatherium": "While it may not seem it at first glance, these massive mammals are relatives to the now arboreal sloths. Due to not having any living descendants, these creatures must be revived via a birthing pod. These creatures thrived during the Early Pliocene to Early Holocene, feeding on now extinct fruits and digging massive dens. While their preferred fruits may be gone, if one were to spend the time and raise a baby sloth using a sack and carrying it around, they may gain the trust of these animals. When tamed, they can be ridden and used as great dirt excavators, digging lots of dirt in very small amounts of time.",
      "jei_desc.chocolate.megalania": "A large monitor lizard from the Pleistocene, these large lizards are quite territorial. While they will tolerate a person for some time, they'll quickly lose their temper and attack with a wide variety of claw swings, tail swipes and bites. Their bites inflict a rather dreadful venom that reduces the maximum health. If one is brave enough to let a megalania lick their weapon, it will temporarily be coated in this venom. A very interesting behavior that these lizards have is their reaction to colder and hotter temperatures. Lizards born in colder environments have different colors than those in hot environments. Though be wary, as megalania in cold environments tend to sleep while megalania in hot environments are much more active and aggressive.",
      "jei_desc.chocolate.mammoth": "The most famous extinct mammal of them all, the great Wooly Mammoth. These large elephants roamed the cold wastes from the Middle Pleistocene to Late Holocene. Their DNA can be obtained regularly through permafrost fossils, however sometimes larger glacial icebergs will have entirely frozen specimens inside them, bolstering a much higher chance of mammoth DNA. Due to not having any living descendants, these creatures must be revived via a birthing pod. These large animals roam in great herds, being quite defensive of their younger compatriots in the group. They also tend to follow the eldest member of their species, who are usually indicated by their much greyer hair compared to others. One can actually earn the respect of these large beasts by wearing a Tyrant's Crown. While wearing a tyrant's crown, one can shear out various items that become caught in their fur. These can range from random junk such as string or bones to the occasional brown wool. However, if one doesn't want to become the king of the mammoths they can be chopped up and compressed into a extremely healthy meatball.",
      "jei_desc.chocolate.majungasaurus": "Strange island-borne Abelisaurs of the late Cretaceous period. A Majungasaurus' binocular eyes allow them to track mobile prey with ease, and their powerfully long legs propel them towards their prey with a surprising burst of speed. While aggressive, these creatures are rather clumsy, unlike their relatives there charges are fairly inaccurate, though this does not mean there bite is not strong. Do be wary keeping individuals together, as the species is known for cannibalism. Feeding these animals a chunk of raw Cotylorhynchus pacifies them for awhile. Their horn is not tough enough to penetrate a shield, if they ram into a shield they may get stunned and scutes on their head may loosen and fall off, these can be collected by the player. These scutes can be made into a helmet that grants strength.",
      "jei_desc.chocolate.leefructus": "Leefructus is apart of a extinct genus of flowering plant from the early cretaceous. These plants can be placed on land and can be crafted into yellow dye.",
      "jei_desc.chocolate.kentro": "A stegosaurid from the late Jurassic, these small dinosaurs are relatively peaceful creatures. They spend most of their days grazing and moving through thick undergrowth. This lackadaisical lifestyle would at first glance make these creatures rather easy prey, however the massive spikes on their sides and tail prevent this from happening. When fed a horsetail, these dinosaurs will curl up into a defensive stance, preventing them from being moved while also damaging would be attackers.",
      "jei_desc.chocolate.hwacha": "One of the most anomalous finds from the rare amber, classifying this dinosaur was extremely hard due to its rather mythical abilities. A current theory is that this dinosaur is a neotheropod  that survived into the late Jurassic era. This medium-sized theropod has a rather deadly hunting tactic. Through a series of complex biological processes, this dinosaur can launch a barrage of sharp spines from its frills being able to gun down most threats. Whats even more shocking and to an extent horrifying is these creatures' ability to be tamed by giving it a Meaty Buffet. When tamed these dinosaurs can launch their spines in any direction the owner would like.",
      "jei_desc.chocolate.gingko": "Prehistoric Ginkgo is a common tree that has been around since the Triassic and has been florishing since then. These trees rarely drop their nuts when chopped, which can be cooked or fed to various prehistoric animals. Ginkgo wood is yellow in color and can be crafted into a wide variety of wood products.",
      "jei_desc.chocolate.fruit_box": " So far here is a list of everything I have gotten from each 'tier' of gigantopithecus fruit: Exotic Fruit Box (Traded for Zuloagae): Exotic Fruit Scraps. Horsetail, Hanging Roots, Pumpkin Seeds, Melon Seeds. Luxurious Fruit Box (Traded for Exotic Fruit): Redolent Fruit Scraps, Exotic Fruit Scraps, Horsetail, Tall Horsetail, Leefructus, Bennettitales, Sarracenia, Tall Sarracenia, Archaeosigillaria, Handmade Battleaxe, Glistering Melon Slice, Carrot. Redolent Fruit Box (Traded for Exotic Fruit): Salubrious Fruit Scraps, Redolent Fruit Scraps, Handmade Club, Lapis Lazuli, Gold Nuggets, Carrots, Crocarina. Salubrious Fruit Box (Traded for Exotic Fruit): Salubrious Fruit Scraps, Handmade Spear, Emeralds, Iron Nuggets, Golden Carrots, Prehistoric Ginkgo Saplings, Foxii Saplings, Dryophyllum Saplings, Zuloagae Disc.",
      "jei_desc.chocolate.gigantopithicus": "A massive orangutan hailing from the Early to Middle Pleistocene, these docile creatures may be one of the most sophisticated creatures revived yet. Due to not having any living descendants, these creatures must be revived via a birthing pod. They spend most of their days milling about, exploring the world around them. However when presented with a revived ancient bamboo called Zuloagae, they open up showing a wide array of goods. While I am unsure where they get the goods, they offer a wide variety exotic goods hailing from never before seen fruits to seemingly handcrafted weapons. When traded, they'll give the buyer a massive fruit that seemingly has been stuffed to the brim with random goods. Depending on what fruit you trade, better items are obtained.",
      "jei_desc.chocolate.foxii": "Foxii, or Metasequoia foxii, is a extinct redwood tree known solely from the Paleocene. These massive trees tower above their spruce relatives, almost doubling height of the tallest spruce trees. To actually grow these trees, they need to be placed in a 2x2 area with lots of space. Be very wary when growing these, as their stumps can easily reach 9 blocks thick, and their leaves larger. Their wood is a dark red color and can be crafted into a variety of products.",
      "jei_desc.chocolate.eryon": "Eryon was a small crustacean that roamed the earth during the Late Jurassic period. It was found in the Solnhofen Limestone and inhabited coastal swamps and marshlands. These crustaceans   are docile, often feeding off of microscopic organisms, but they also dig for things like food. When digging around they have a chance of uncovering materials and junk, this includes; bones, gold nuggets, iron nuggets, and string. They sometimes uncover preserved fossils when digging which can be placed around as decoration!",
      "jei_desc.chocolate.encrusted": "Disgusting abominations from the Mesozoic era, these beasts are coated in a sticky sap-like substance. Unlike most other revived animals, these creatures seem to have been shaped by their preservation, with the sap seemingly changing the genetic makeup. These vile creatures attack through both stabbing with their proboscis and launching a sappy substance at high speeds.Despite their corrupted nature, their abdomen acts as a good way to store blood. This can be refitted and crafted into a DNA Fridge, allowing for mass storage of DNA in a compressed container.",
      "jei_desc.chocolate.dunk": "Apex predators of the late Devonian period, the only creature that threatened a Dunkleosteus' presence is its own kind. Their gaping maws are uniquely adapted with extremely fast-acting muscles that open their jaws in an instant, creating a pressure difference that sucks in their armoured prey at range, which they ambush in dark waters akin to a catfish of the modern times. Dunkleosteus tolerates no other organisms in its vicinity, and attacks anything that approaches near them. Husbandry and captive maintenance with these placoderms are quite challenging in that they will often attack their handlers, and their constantly-sharpened jawblades part armour with ease, yet these jawblades also extract extra nutrients and useful material from their prey. These beasts are quite fond of Scaumenacia and can even be pacified using gold encrusted ones. Though this pacification causes the fish to no longer attack any animals, taking away from its extracting capabilities.",
      "jei_desc.chocolate.dryophyllum": " Dryophyllum is a small tree from the late cretaceous. Their wood is pink and can be crafted into a wide wood set that shares this pink wood.",
      "jei_desc.chocolate.coty": "Cotylorhynchus is a massive browser of immense width who feeds upon bushes of fern and horsetails with their abysmally small heads. These cow-like herbivores are closer to mammalian ancestors than any archosaurs despite their resemblance to some sauropods, and they behave the part with their massive stomachs that digest fibrous plant matter easily. Their meat is quite nutritious. Another use for these large beasts is the production of a liquid called grog, a rather powerful drink that can induce a wide variety of effects. Remember to drink responsibly.",
      "jei_desc.chocolate.clathrodictyon": " Clathrodictyon were apart of the vast reef builder sponges that ruled the paleozoic. Clathrodictyon in particular is from the Silurian peroid.",
      "jei_desc.chocolate.brachi": " These massive Jurassic sauropods are quite the sight to behold, standing over 13 blocks tall. These gargantuan animals spend most of their time grazing on tall trees, paying little attention to the world around them. With such a large size, many have attempted to saddle these beasts for warfare. However, these attempts mostly fail as these large dinosaurs dislike being ridden, throwing their rider away to extreme heights. These beasts cannot be ridden as teens as they are too rambunctious.  Though they mean no ill will as they bless their would be riders with divine protection, protecting them from fall damage. Skilled people use this to their advantage, making them living elytra launchers.",
      "jei_desc.chocolate.bennet": "Bennettitales is a part of a rather vast group of seed plants that appeared during the Permian before becoming extinct towards the end of the Cretaceous. These plants can be planted on land and can be crafted into brown dye.",
      "jei_desc.chocolate.beelz": "A cretaceous frog of immense proportions, Beelzebufo is considered to be an extinct relative of the ceratophryidae, which is a part of the frog group that diverged from primitive amphibians during the late cretaceous and contains, in modern day, horned frogs. Much like their modern relatives, these massive frogs have a very voracious appetite, consuming most small animals in their path. Due to their large size, these animals can be saddled and ridden, however they can only be controlled using meat on a stick. These frogs can be controlled to hop fairly high, though some individual frogs jump much higher than others. When feeding, these animals can sometimes leave excess saliva which acts as a unique bonding agent that allows for the creation of name tags.",
      "jei_desc.chocolate.barinasuchus": "A large crocodilian from the Middle Eocene to Middle Miocene, these brutish reptiles are extremely hostile. Their large size, fast running speed, combined with a powerful bite makes them a force to be reckoned with. While taming through conventional means proved to be futile, these animals do enjoy the sound of a fabled crocoarina, a item that can only be obtained by bartering with a gigantopithecus. Hearing the tunes from this instrument seemingly form a bond with the musician, being loyal until the end. While saddling has proven futile, these beasts can be used as a powerfu tool in combat especially in numbers.",
      "jei_desc.chocolate.austro": "A relatively large dromaeosaur from the Late Cretaceous, these graceful creatures are docile unless provoked. They spend most of their days hunting for fish and other small prey. These creatures have rather graceful plumage, with large prominent red crests adorning the side of their face and the top of their head. Sometimes they will groom themselves, leaving behind a few feathers in the process. These feathers can be used to craft boots that negate fall damage. These dinosaurs also drop meat on their death. While not the best meat on the menu, other dinosaurs such as Ulughbegsaurus enjoy it.",
      "jei_desc.chocolate.archaeos": "Archaeosigilaria is a part of the genus of Sigillaria, a group of spore bearing plants from the Carboniferous and Permian periods. These plants are planted on land and can be turned into green dye",
      "jei_desc.chocolate.archaefructus": " This plant is apart of an extinct group of aquatic seed plants that lived during the early cretaceous. This plant is hypothesized to be one of the earliest flowering plants. These plants can only be planted underwater and can be converted into yellow dye.",
      "jei_desc.chocolate.anuro": "Oddities in the pterosaur families for their flat faces and forward-facing eyes, Anurognathus look more akin to a frog-owl than any other pterosaur. These pterosaurs are primarily insectivores, consuming arthropods quite voraciously. A curious behavior sighted in these animals is pollination similar to that of bees, which allows crops to grow much faster.",
      "jei_desc.chocolate.antarcto": "A medium sized ankylosaur that lived during the late Cretaceous, these hardy herbivores are one of the toughest dinosaurs.. Their hard scutes and sheer weight prevent them from being easily moved, not to mention their almost axe-like tails that can slice most threats in half. These dinosaurs are rather defensive when it comes to hostile threats, as they will go after just about any hostile monster with horrific results for the victim.     Sometimes during their slicing fests, they will lose a few of their tail scutes which can be fashioned into a rather crude but effective heavy weapon. This weapon is said to be able to behead a ravager in one fell swoop.",
      "jei_desc.chocolate.ammon": "A rather broad group of cephalopods that lived all throughout time, only going extinct during the end of the cretaceous period. Like many smaller aquatic animals, they can be bucketed. On death these animals drop shell shards, which can be used to recreate an ammonite shell or they can be made into a war pick. War picks act as both a way to mine and engage in combat.",
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
      "jei_desc.chocolate.end_of_book": "end"
  
      
    
    
  }